In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("weight-height.csv")

In [3]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [4]:
df.shape

(10000, 3)

In [5]:
df.isnull().sum()

Gender    0
Height    0
Weight    0
dtype: int64

In [6]:
x = pd.get_dummies(df["Gender"])

In [7]:
x

      Female  Male
0          0     1
1          0     1
2          0     1
3          0     1
4          0     1
...      ...   ...
9995       1     0
9996       1     0
9997       1     0
9998       1     0
9999       1     0

[10000 rows x 2 columns]

In [8]:
df = pd.concat([df,x],axis=True)

In [9]:
df

      Gender     Height      Weight  Female  Male
0       Male  73.847017  241.893563       0     1
1       Male  68.781904  162.310473       0     1
2       Male  74.110105  212.740856       0     1
3       Male  71.730978  220.042470       0     1
4       Male  69.881796  206.349801       0     1
...      ...        ...         ...     ...   ...
9995  Female  66.172652  136.777454       1     0
9996  Female  67.067155  170.867906       1     0
9997  Female  63.867992  128.475319       1     0
9998  Female  69.034243  163.852461       1     0
9999  Female  61.944246  113.649103       1     0

[10000 rows x 5 columns]

In [10]:
df = df.drop(["Gender"],axis=1)

In [11]:
df

         Height      Weight  Female  Male
0     73.847017  241.893563       0     1
1     68.781904  162.310473       0     1
2     74.110105  212.740856       0     1
3     71.730978  220.042470       0     1
4     69.881796  206.349801       0     1
...         ...         ...     ...   ...
9995  66.172652  136.777454       1     0
9996  67.067155  170.867906       1     0
9997  63.867992  128.475319       1     0
9998  69.034243  163.852461       1     0
9999  61.944246  113.649103       1     0

[10000 rows x 4 columns]

In [12]:
y = df["Height"]

In [13]:
y

0       73.847017
1       68.781904
2       74.110105
3       71.730978
4       69.881796
          ...
9995    66.172652
9996    67.067155
9997    63.867992
9998    69.034243
9999    61.944246
Name: Height, Length: 10000, dtype: float64

In [14]:
df = df.drop(["Height"],axis=1)

In [15]:
df

          Weight  Female  Male
0     241.893563       0     1
1     162.310473       0     1
2     212.740856       0     1
3     220.042470       0     1
4     206.349801       0     1
...          ...     ...   ...
9995  136.777454       1     0
9996  170.867906       1     0
9997  128.475319       1     0
9998  163.852461       1     0
9999  113.649103       1     0

[10000 rows x 3 columns]

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
dftrain,dftest,ytrain,ytest = train_test_split(df,y,test_size = 0.25,random_state=0)

In [21]:
from sklearn.linear_model import LinearRegression

In [25]:
model = LinearRegression()

In [26]:
reg = model.fit(dftrain, ytrain)

In [27]:
reg.predict(dftrain)

array([69.12267191, 69.12672369, 72.4401882 , ..., 66.01464576,
       63.82345008, 69.20516556])

In [30]:
reg.predict([[241.893563,1,0]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([76.73436122])

In [28]:
reg.score(df,y)

0.8608926641371121